hungrynagini/rangefinder-STM32F3/Src/main.c

/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  ** This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * COPYRIGHT(c) 2018 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f3xx_hal.h"
#include "spi.h"
#include "tim.h"
#include "gpio.h"

/* USER CODE BEGIN Includes */
#include "lcd5110.h"
#define SystemCoreClockInMHz (SystemCoreClock/1000000)

/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */
LCD5110_display lcd1;
volatile uint32_t tim6_overflows = 0;

void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  if( htim->Instance == TIM6 )
  {
   ++tim6_overflows;
  }
}
void TIM6_reinit()
{
 HAL_TIM_Base_Stop(&htim6);
 __HAL_TIM_SET_PRESCALER( &htim6, (SystemCoreClockInMHz-1) );
 __HAL_TIM_SET_COUNTER( &htim6, 0 );
 tim6_overflows = 0;
 HAL_TIM_Base_Start_IT(&htim6);
}
inline uint32_t get_tim6_us()
{
 __HAL_TIM_DISABLE_IT(&htim6, TIM_IT_UPDATE); //!
 //__disable_irq();
 uint32_t res = tim6_overflows * 10000 + __HAL_TIM_GET_COUNTER(&htim6);
 //__enable_irq();
 __HAL_TIM_ENABLE_IT(&htim6, TIM_IT_UPDATE);
 return res;
}
inline void udelay_TIM6(uint32_t useconds) {
 uint32_t before = get_tim6_us();
 while( get_tim6_us() < before+useconds){}
}
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  *
  * @retval None
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_TIM6_Init();
  MX_SPI2_Init();
  TIM6_reinit();
  /* USER CODE BEGIN 2 */

    TIM6_reinit();
    lcd1.hw_conf.spi_handle = &hspi2;
        lcd1.hw_conf.spi_cs_pin =  cs_Pin;
        lcd1.hw_conf.spi_cs_port = cs_GPIO_Port;
        lcd1.hw_conf.rst_pin =  rst_Pin;
        lcd1.hw_conf.rst_port = rst_GPIO_Port;
        lcd1.hw_conf.dc_pin =  dc_Pin;
        lcd1.hw_conf.dc_port = dc_GPIO_Port;
        lcd1.def_scr = lcd5110_def_scr;
        LCD5110_init(&lcd1.hw_conf, LCD5110_NORMAL_MODE, 0x40, 2, 3);

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
      int error_code = 0;
	  LCD5110_set_cursor(0, 0, &lcd1);

	  int t_state = HAL_GPIO_ReadPin(GPIOD, GPIO_PIN_14);
	     while(  t_state == GPIO_PIN_SET )
	     {
	      printf("Wrong state before triggering, Trig is high\n");
	      error_code = 1;
	      udelay_TIM6(300);
	     }
	     HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14, GPIO_PIN_SET);
	     if ( HAL_GPIO_ReadPin(GPIOD, GPIO_PIN_14) != GPIO_PIN_SET )
	     {
	      printf("Line Trig do not went high while triggering.\n");
	      error_code = 2;
	      HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14, GPIO_PIN_RESET);
	      udelay_TIM6(300);
	     }
	     udelay_TIM6(1600);
	     HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14, GPIO_PIN_RESET);
	     if ( HAL_GPIO_ReadPin(GPIOD, GPIO_PIN_14) != GPIO_PIN_RESET )
	     {
	      printf("Line Trig do not went low after triggering.\n");
	      error_code = 3;
	      HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14, GPIO_PIN_RESET);
	      udelay_TIM6(300);
	     }
	     if ( HAL_GPIO_ReadPin(GPIOD, GPIO_PIN_15) == GPIO_PIN_SET )
	     {
	      printf("Line ECHO is high too early.\n");
	      error_code = 4;
	      udelay_TIM6(300);
	     }

	     uint32_t watchdog_begin = get_tim6_us();
	     int didnt_had_1_at_echo = 0;
	     while(HAL_GPIO_ReadPin(GPIOD, GPIO_PIN_15) == GPIO_PIN_RESET )
	     {
	      if( get_tim6_us() - watchdog_begin > 500000 )
	      {
	       didnt_had_1_at_echo = 1;
	       break;
	      }
	     }
	     if(didnt_had_1_at_echo)
	     {
	      printf("Line ECHO didn't go high for a long time.\n");
	      error_code = 5;
	      udelay_TIM6(300);
	     }

	     uint32_t before = get_tim6_us();
	     int didnt_had_0_at_echo = 0;
	     while(HAL_GPIO_ReadPin(GPIOD, GPIO_PIN_15) == GPIO_PIN_SET )
	     {
	      if( get_tim6_us() - watchdog_begin > 500000 )
	      {
	       didnt_had_0_at_echo = 1;
	       break;
	      }
	     }
	     if(didnt_had_0_at_echo)
	     {
	      printf("Line ECHO didn't go low after echoing pulse stared for a long time.\n");
	      error_code = 6;
	      udelay_TIM6(300);
	     }


	     uint32_t pulse_time = (get_tim6_us()-before)/1000;
	     uint32_t distance = pulse_time*343/20;


	     if( distance > 500 )
	     {
	      printf("\tToo far -- possibly no echo at all.");
	      error_code = 7;
	      udelay_TIM6(300);
	     }

	     if(!error_code){
	     printf("Time: %lu us, distance: %lu cm\n",
	       pulse_time,
	       distance);
	     LCD5110_printf(&lcd1, BLACK, "Len: %lu cm\n", distance );}

	     else{LCD5110_printf(&lcd1, BLACK, "Error %lu\n", error_code); error_code = 0;}



		  udelay_TIM6(3000);

		  LCD5110_clear_str(0, 0, 83, WHITE, &lcd1);
		  LCD5110_set_cursor(0, 0, &lcd1);




//
//	     uint32_t pulse_time = (get_tim6_us()-before)/1000;
//	     char* d1[100];
//	     itoa(pulse_time,d1,10);
//	     char* d2[100];
//	     itoa(pulse_time*343/20, d2, 10);
//
//	     char s[100] = "Dick: ";
//	     strcat(s, d2);
//	     LCD5110_print(s, BLACK, &lcd1);
//	     printf("Time: %lu ms, distance: %lu cm\n", pulse_time, pulse_time*343/20);
  /* USER CODE END WHILE */

  /* USER CODE BEGIN 3 */

  }
  /* USER CODE END 3 */

}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{

  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.HSEPredivValue = RCC_HSE_PREDIV_DIV1;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL3;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_0) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Configure the Systick interrupt time 
    */
  HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/1000);

    /**Configure the Systick 
    */
  HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

  /* SysTick_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);
}

/* USER CODE BEGIN 4 */

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  file: The file name as string.
  * @param  line: The line in file as a number.
  * @retval None
  */
void _Error_Handler(char *file, int line)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  while(1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t* file, uint32_t line)
{ 
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
